// © Copyright 2012-2015 HP Development Company, L.P.

TaskName = "HP Printer Web Services";
TaskTOCTitle = "HP Web Services";
SummarySucceededTaskName = "HP Web Services are activated!";
SummaryFailedTaskName = "Unable to activate HP Web Services";
SummaryUpdateAvailableName = "Update available";
SummaryTaskTOCTitle = "Summary";

EnableWebServicesButtonTitle = "Yes, I accept the Terms of Use.";
SkipWebServicesEnablingCaption = "Press Skip if you do not want to enable Web Services.";

AlreadyEnabledTitle = "The printer has been successfully connected to your network!\nHP Internet connected printers offer exciting and innovative new services such as HP Touchsmart Apps, ePrint and automatic product updates. For more information on these services, refer to your product documentation or visit";
AlreadyEnabledText = "HP Web Services are already activated on your printer. Click the button below to print a page with more details and the ePrint address for this printer.";
PrintWebServicesDetailsButtonTitle = "Print HP Web Services Details";
EPrintCenterLink = "http://www.hpconnected.com";

UpdateIsAvailableCaption = "An update is available for your device that is required to enable Web Services. Press the ePrint button on the device to apply the update. You will be guided through the process.";

LookingForDeviceUpdateProgressTitle = "Device is searching for updates… Please wait.";
EnableWebServicesProgressTitle = "Configuring Web Services on your printer… Please wait.";

WebServicesEnablingSucceededCaption = "Web Services were successfully activated on your printer.\n\nThe printer will now print a page with additional information on HP Web Services and the printer's ePrint address.";
WebServicesEnablingFailedCaption = "The HP Web Services for this printer could not be activated at this time. This could be due to a temporary problem with the Internet connection to the web service, or your printer may require a product update.\r\rPlease try activating the HP Web Services again later by pressing the ePrint button on the printer. If a product update is required, you will be guided through completing Web Services configuration at that time.\r\rThis will not impact other features of your printer. Your printer will still print and perform all of its other functions normally.";

HSDProductUpdate = "Product updates:";
HSDAutomaticalyUpdate = "Automatically update my product (recommended)";
HSDNotifyBeforeUpdate = "Notify me before updating my product";
HSDNeverUpdate = "Never update my product";

HSDDisableWebServicesTitle = "Do you want to disable Web Services?";
HSDAllowProductUpdatesTitle = "Do you want to allow product updates?";
HSDAllowProductUpdatesText = "To use Web Services you will need to allow the printer to check for updates.";
HSDDisableWebServices = "Disable Web Services";
HSDUpdateAutomatically = "Update Automatically";
HSDNotifyBeforeUpdating = "Notify Before Updating";